package main.java.lesson1;

/* Мое имя
Вывести на экран свое имя 5 строк по 10 раз (через пробел).
System.out.println, System.out.print можно использовать только по одному разу
для этого нужно воспользоваться циклом for
*/

public class Task2 {

    public static void main(String[] args) {
        System.out.println(name10Times());
    }

    public static String name10Times() {
        String someString = "";

        for (int i = 0; i <=10 ; i++) {

        }

            return someString;
        }
}